src/Catalogs/рнсШаблонНабораДанных/рнсШаблонНабораДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>рнсШаблонНабораДанных</name>
  <attributes>
    <name>ТипШаблона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоступныеЗначения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Реквизиты</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипПараметра</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТабличныеЧасти</name>
    <attributes>
      <name>ИмяТабличнойЧасти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КолонкиТабличныхЧастей</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипПараметра</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/рнсШаблонНабораДанных/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриСозданииЧтенииНаСервере();		
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	МассивИменТаблиц = Новый Массив;
	МассивИменТаблиц.Добавить("Реквизиты");
	МассивИменТаблиц.Добавить("КолонкиТабличныхЧастей");
	
	Для каждого ИмяТаблицы Из МассивИменТаблиц Цикл	
		
		ТаблицаФормы 	= Объект[ИмяТаблицы]; 
		ТаблицаОбъекта 	= ТекущийОбъект[ИмяТаблицы];
		
		ТаблицаОбъекта.Очистить();
		
		Для каждого ТекСтрока Из ТаблицаФормы Цикл 
			
			НоваяСтрока = ТаблицаОбъекта.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
			
			Если ЗначениеЗаполнено(ТекСтрока.ПредставлениеТипа) Тогда
				
				МассивВыбранныхТипов = Новый Массив;
				Для каждого Ит Из ТекСтрока.ПредставлениеТипа Цикл
					МассивВыбранныхТипов.Добавить(Тип(Ит));	
				КонецЦикла;				
				 
				НоваяСтрока.ТипПараметра = ЗначениеВСтрокуВнутр(Новый ОписаниеТипов(МассивВыбранныхТипов));
				
			Иначе			
				НоваяСтрока.ТипПараметра = "";			
			КонецЕсли; 		 
			
		КонецЦикла;	
	
	КонецЦикла;
	
	ДоступныеЗначения = ТаблицаДопустимыхЗначений.Выгрузить(); 	
	ТекущийОбъект.ДоступныеЗначения = Новый ХранилищеЗначения(ДоступныеЗначения);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ПриСозданииЧтенииНаСервере();	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРеквизиты

&НаКлиенте
Процедура РеквизитыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ОткрытьФормуРедактированияПараметраШаблона(Элементы.Реквизиты.ТекущиеДанные, НоваяСтрока);	
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыПередУдалением(Элемент, Отказ)
	
    ТекущаяСтрока = Элементы.Реквизиты.ТекущиеДанные;
	
	ОчиститьДопустимыеЗначенияПараметра(ТекущаяСтрока.ИмяПараметра);	
	
КонецПроцедуры  

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовТаблицыФормыТабличныеЧасти

&НаКлиенте
Процедура ТабличныеЧастиПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элементы.ТабличныеЧасти.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		Элементы.КолонкиТабличныхЧастей.ОтборСтрок = Новый ФиксированнаяСтруктура("КлючСвязи", ТекущаяСтрока.КлючСвязи);		
	КонецЕсли;
	
КонецПроцедуры   

&НаКлиенте
Процедура ТабличныеЧастиПередУдалением(Элемент, Отказ)
	
	ТекущаяСтрока = Элементы.ТабличныеЧасти.ТекущиеДанные;
	МассивКолонок = Объект.КолонкиТабличныхЧастей.НайтиСтроки(Новый Структура("КлючСвязи", ТекущаяСтрока.КлючСвязи));
	                                         
	Для каждого Ит Из МассивКолонок Цикл
		Объект.КолонкиТабличныхЧастей.Удалить(Ит);	
	КонецЦикла;	
	
КонецПроцедуры  

&НаКлиенте
Процедура ТабличныеЧастиПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если НоваяСтрока Тогда	
		
		ТекущаяСтрока = Элементы.ТабличныеЧасти.ТекущиеДанные;
		
		Если ТекущаяСтрока <> Неопределено Тогда
			ТекущаяСтрока.КлючСвязи = Объект.ТабличныеЧасти.Количество();		
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовТаблицыФормыКолонкиТабличныхЧастей

&НаКлиенте
Процедура КолонкиТабличныхЧастейПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущаяСтрокаКолонки = Элементы.КолонкиТабличныхЧастей.ТекущиеДанные;
	
	Если НоваяСтрока Тогда 	
	
		ТекущаяСтрокаТабличныхЧастей = Элементы.ТабличныеЧасти.ТекущиеДанные; 	
		
		Если ТекущаяСтрокаТабличныхЧастей <> Неопределено И ТекущаяСтрокаКолонки <> Неопределено Тогда
			ТекущаяСтрокаКолонки.КлючСвязи = ТекущаяСтрокаТабличныхЧастей.КлючСвязи;			
		КонецЕсли;	
	
	КонецЕсли;	
	
	ОткрытьФормуРедактированияПараметраШаблона(ТекущаяСтрокаКолонки, НоваяСтрока);
	
КонецПроцедуры 

&НаКлиенте
Процедура КолонкиТабличныхЧастейПередУдалением(Элемент, Отказ)
	
	ТекущаяСтрока = Элементы.КолонкиТабличныхЧастей.ТекущиеДанные;
	
	ОчиститьДопустимыеЗначенияПараметра(ТекущаяСтрока.ИмяПараметра, ТекущаяСтрока.КлючСвязи);		
	
КонецПроцедуры  

#КонецОбласти   

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьФормуРедактированияПараметраШаблона(ТекущаяСтрока, НоваяСтрока)
	                             
	Оповещение = Новый ОписаниеОповещения("РедактированиеПараметра_Завершение", ЭтотОбъект, Новый Структура("ТекущаяСтрока", ТекущаяСтрока)); 
	
	ДанныеПараметра = Новый Структура;
	ДанныеПараметра.Вставить("ИмяПараметра", ТекущаяСтрока.ИмяПараметра);  	
	ДанныеПараметра.Вставить("ТипПараметра", ТекущаяСтрока.ПредставлениеТипа.ВыгрузитьЗначения());  
	ДанныеПараметра.Вставить("Описание", ТекущаяСтрока.Описание);
	ДанныеПараметра.Вставить("ЗначениеПоУмолчанию", Неопределено);
	ДанныеПараметра.Вставить("СписокЗначений", Новый Массив);
	
	Если НЕ НоваяСтрока Тогда  
		
		ОтборДопустимыхЗначений = Новый Структура;
		ОтборДопустимыхЗначений.Вставить("ИмяПараметра", ТекущаяСтрока.ИмяПараметра);   
		ОтборДопустимыхЗначений.Вставить("КлючСвязи", "");
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока, "КлючСвязи") Тогда
			                                  		
			КлючСвязи 				= ТекущаяСтрока.КлючСвязи;	
			СтрокиТабличныхЧастей 	= Объект.ТабличныеЧасти.НайтиСтроки(Новый Структура("КлючСвязи", КлючСвязи));			
			             					
			ДанныеПараметра.Вставить("ИмяТабличнойЧасти", СтрокиТабличныхЧастей[0].ИмяТабличнойЧасти); 			
			ДанныеПараметра.Вставить("КлючСвязи", ТекущаяСтрока.КлючСвязи);  
			
			ОтборДопустимыхЗначений.Вставить("КлючСвязи", КлючСвязи);
			
		КонецЕсли;  
		
		СтрокиДопустимыхЗначений = ТаблицаДопустимыхЗначений.НайтиСтроки(ОтборДопустимыхЗначений); 
		Если СтрокиДопустимыхЗначений.Количество() = 1 И СтрокиДопустимыхЗначений[0].ЭтоЗначениеПоУмолчанию Тогда
			ДанныеПараметра.Вставить("ЗначениеПоУмолчанию", СтрокиДопустимыхЗначений[0].Значение);
		Иначе
			Для каждого Ит Из СтрокиДопустимыхЗначений Цикл
				
				ДанныеПараметра.СписокЗначений.Добавить(Ит.Значение);	
				
				Если Ит.ЭтоЗначениеПоУмолчанию Тогда  
					ДанныеПараметра.Вставить("ЗначениеПоУмолчанию", Ит.Значение);					
				КонецЕсли;
				
			КонецЦикла;	
		КонецЕсли;		
		
	КонецЕсли;
	
	ОткрытьФорму("Справочник.рнсШаблонНабораДанных.Форма.ФормаПараметраШаблона", 
						ДанныеПараметра, ЭтотОбъект,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
КонецПроцедуры  

&НаСервере
Процедура ПриСозданииЧтенииНаСервере()
	
	ШаблонОбъект 		= РеквизитФормыВЗначение("Объект");
	ДоступныеЗначения	= ШаблонОбъект.ДоступныеЗначения.Получить(); 
	
	Если ЗначениеЗаполнено(ДоступныеЗначения) Тогда
		ТаблицаДопустимыхЗначений.Загрузить(ДоступныеЗначения);		
	КонецЕсли;
	
	МассивТаблиц = Новый Массив;
	МассивТаблиц.Добавить(Объект.Реквизиты);
	МассивТаблиц.Добавить(Объект.КолонкиТабличныхЧастей);
	
	Для каждого Таблица Из МассивТаблиц Цикл	
		
		Для каждого СтрокаПараметры Из Таблица Цикл 
			
			СтрокаПараметры.ПредставлениеТипа.Очистить();
			
			Если ЗначениеЗаполнено(СтрокаПараметры.ТипПараметра) Тогда
				
				ОписаниеТипов = ЗначениеИзСтрокиВнутр(СтрокаПараметры.ТипПараметра);  			
				
				Для каждого ТекущийТип Из ОписаниеТипов.Типы() Цикл 
					
					МетаданныеОбъекта = Метаданные.НайтиПоТипу(ТекущийТип);
					
					Если МетаданныеОбъекта = Неопределено Тогда 					     					
						Если ТекущийТип = Тип("УникальныйИдентификатор") Тогда
							ИмяТипа = "УникальныйИдентификатор";
						Иначе
							ИмяТипа = Строка(ТекущийТип);	
						КонецЕсли; 							
					Иначе
						ИмяТипа	= СтрЗаменить(МетаданныеОбъекта.ПолноеИмя(), ".", "Ссылка.");	
					КонецЕсли;
					
					СтрокаПараметры.ПредставлениеТипа.Добавить(ИмяТипа);
					
				КонецЦикла;								
							
			КонецЕсли; 		 
			
		КонецЦикла;	
	
	КонецЦикла;	
	
КонецПроцедуры  

#Область ПодключаемыеОбработчики

&НаКлиенте
Процедура РедактированиеПараметра_Завершение(Результат, ДополнительныеПараметры) Экспорт

	Если ЗначениеЗаполнено(Результат) Тогда 
		
		ТекущаяСтрока 				= ДополнительныеПараметры.ТекущаяСтрока; 
		ИмяПараметра				= ТекущаяСтрока.ИмяПараметра;
		ТекущаяСтрока.ИмяПараметра 	= Результат.ИмяПараметра; 
		ТекущаяСтрока.Описание 		= Результат.Описание;
		КлючСвязи 					= Неопределено;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока, "КлючСвязи") Тогда
			КлючСвязи = ТекущаяСтрока.КлючСвязи;	
		КонецЕсли;
		
		ТекущаяСтрока.ПредставлениеТипа.ЗагрузитьЗначения(Результат.ТипПараметра);		  
		
		ОчиститьДопустимыеЗначенияПараметра(ИмяПараметра, КлючСвязи);
		
		Если ЗначениеЗаполнено(Результат.СписокЗначений) Тогда   		
			Для каждого Ит Из Результат.СписокЗначений Цикл 				
				НоваяСтрока 							= ТаблицаДопустимыхЗначений.Добавить();
				НоваяСтрока.Значение 					= Ит;
				НоваяСтрока.ИмяПараметра 				= Результат.ИмяПараметра;
				НоваяСтрока.КлючСвязи 					= КлючСвязи;  
				НоваяСтрока.ЭтоЗначениеПоУмолчанию 		= Ит = Результат.ЗначениеПоУмолчанию;				
			КонецЦикла;
		Иначе	
		 	Если ЗначениеЗаполнено(Результат.ЗначениеПоУмолчанию) Тогда
				НоваяСтрока 							= ТаблицаДопустимыхЗначений.Добавить();
				НоваяСтрока.Значение 					= Результат.ЗначениеПоУмолчанию;
				НоваяСтрока.ИмяПараметра 				= Результат.ИмяПараметра;
				НоваяСтрока.КлючСвязи 					= КлючСвязи;  
				НоваяСтрока.ЭтоЗначениеПоУмолчанию 		= Истина;		
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры 

#КонецОбласти 

&НаКлиенте
Процедура ОчиститьДопустимыеЗначенияПараметра(ИмяПараметра, КлючСвязи = Неопределено)
	
	ОтборДопустимыхЗначений = Новый Структура;
	ОтборДопустимыхЗначений.Вставить("ИмяПараметра", ИмяПараметра);
	ОтборДопустимыхЗначений.Вставить("КлючСвязи", "");
	
	Если ЗначениеЗаполнено(КлючСвязи) Тогда
		ОтборДопустимыхЗначений.Вставить("КлючСвязи", КлючСвязи);	
	КонецЕсли; 
	
	СтрокиДопустимыхЗначений = ТаблицаДопустимыхЗначений.НайтиСтроки(ОтборДопустимыхЗначений);
	Для каждого Ит Из СтрокиДопустимыхЗначений Цикл  
		ТаблицаДопустимыхЗначений.Удалить(Ит);				
	КонецЦикла;	
	
КонецПроцедуры    

#КонецОбласти
